{
  "overallExp": {
    "years": "2.4 Yrs"
  },
  "Companies": ["Wipro"],
  "Wipro Exp": {
    "project": "Walmart",
    "ExpYears": "2Yrs",
    "Roles": [
      "Automation Tester",
      "Manual Tester",
      "Back-end Application Developer"
    ],
    "walmart": [
      {
        "role": "Automation Tester",
        "date": "Jan 2021 - April 2021",
        "description": [
          "Worked with API to find the payload in GLS [Global Logistics Systems] Application and checked API calls triggered by them.",
          "Tested over 100+ service keys in GLS and their responds data by comparing with the database.",
          "Used Putty and SuperPutty to connect with the GLS Servers for collecting the payload information from the logs"
        ]
      },
      {
        "role": "Manual Tester",
        "date": "May 2021 - Sept 2021",
        "description": [
          "Worked on RDC ( Regional Distributed Centre) backend programs for Login screen validations.",
          "Manually checked the AD and Local login scenarios in the GLS and RDC Applications.",
          "Checked the login scenarios in RDC Front-end application ( 5 .NET Apps). Analysed the flow in GLS Apps and Supervisor Overrides in every possible scenarios",
          "All test scenarios are logged in JIRA as Test execution and Test cases to keep them monitored."
        ]
      },
      {
        "role": "Back-End Application Developer",
        "date": "Oct 2021 - Nov 2022",
        "description": [
          "Enforce the sites to create Active Directory (AD) domain credentials for active users",
          "Replace local authentication with AD authentication.",
          "Enhanced the User maintenance functionality to accommodate role access definitions ",
          "Cooperating with the development team to design the Security Layer.",
          "Automated critical workloads in database by creating Shell Scripts which reduced 98% of man-work.",
          "Deployed a fully automated batch report which sends report on User's AD Group membership daily.",
          "Enhanced the application's security to avoid Internal threats by 80%."
        ]
      }
    ]
  }
}
